src/Documents/ЗаказНаряд/ЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаряд</name>
  <registerRecords>AccumulationRegister.МатериалыЗаказчиков</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>EnumRef.СостоянияЗаказовНарядов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемыЗаказчиком</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемыМастером</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыЗаказчика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеМатериала</name>
      <type>
        <types>EnumRef.СостояниеМатериаловКлиента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ЗаказыКлиентов/ЗаказыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыКлиентов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/МатериалыЗаказчиков/МатериалыЗаказчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МатериалыЗаказчиков</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ЗаказНаряд/ObjectModule.bsl
// Модуль объекта документа "ЗаказНаряд".
// Содержит логику проведения документа и предварительные расчёты перед записью.

// Основной обработчик проведения документа.
// Формирует движения по регистрам:
//   - "ЗаказыКлиентов" (общий приход суммой документа в разрезе клиента),
//   - "МатериалыЗаказчиков" (приход материалов клиента на склад).
Процедура ОбработкаПроведения(Отказ, Режим)
    
    // 1. Указываем, что движения в этих регистрах будут записываться.
    Движения.ЗаказыКлиентов.Записывать = Истина;
    Движения.МатериалыЗаказчиков.Записывать = Истина;
    
    // 2. Движение по регистру "Заказы клиентов" (приход)     
    ДвижениеЗаказ = Движения.ЗаказыКлиентов.Добавить();
    ДвижениеЗаказ.ВидДвижения = ВидДвиженияНакопления.Приход;
    ДвижениеЗаказ.Период = Дата;
    ДвижениеЗаказ.Клиент = Клиент;
    ДвижениеЗаказ.ЗаказКлиента = Ссылка;   // ссылка на сам документ
    ДвижениеЗаказ.Сумма = СуммаДокумента;  // итоговая сумма документа
    
    // 3. Движения по регистру "Материалы заказчиков" (приход)
    // Для каждой строки табличной части "МатериалыЗаказчика" создаём приходное движение
    // на указанный склад с указанием заказчика (клиента).
    Для каждого СтрокаМЗ Из МатериалыЗаказчика Цикл
        ДвижениеМЗ = Движения.МатериалыЗаказчиков.Добавить();
        ДвижениеМЗ.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеМЗ.Период = Дата;
        ДвижениеМЗ.Номенклатура = СтрокаМЗ.Номенклатура;
        ДвижениеМЗ.Заказчик = Клиент;       // владелец материалов – клиент
        ДвижениеМЗ.Склад = Склад;           // склад, на котором хранятся материалы клиента
        ДвижениеМЗ.Количество = СтрокаМЗ.Количество;
    КонецЦикла;
    
КонецПроцедуры

// Обработчик события "ПередЗаписью".
// Выполняет пересчёт итоговой суммы документа по табличной части "Услуги".
// Это позволяет всегда иметь актуальную сумму перед сохранением (и проведением).
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
      Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    
    СуммаДокумента = Услуги.Итог("Сумма");
КонецПроцедуры
